app/controllers/school_classes_controller.rb

	def create
	  @school_class = SchoolClass.new(school_class_params(:room_number, :title))
	  @school_class.save
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", 224], ["created_at", "2020-04-26 18:03:11.390150"], ["updated_at", "2020-04-26 18:03:11.390150"]]

	def update
	  @school_class = SchoolClass.find(params[:id])
	  @school_class.update(school_class_params(:room_number, :title))
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Marketing 101"], ["updated_at", "2020-04-26 18:06:41.092234"], ["id", 2]]