app/controllers/students_controller.rb

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Stevie"], ["updated_at", "2020-04-26 18:18:21.133462"], ["id", 4]]
---
	def update
	  @student = Student.find(params[:id])
	  @student.update(student_params(:first_name, :last_name))